tutorials/hotRoom/0.orig/rhok
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rhok;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform 1;
    }

    ceiling
    {
        type            calculated;
        value           uniform 1;
    }

    fixedWalls
    {
        type            calculated;
        value           uniform 1;
    }
}

// ************************************************************************* //
